from exceptions import InvalidMoodError
from decorators import validate_mood

class MovieRecommender:
    """Класс для подбора фильмов по настроению."""
    def __init__(self):
        self.movies_by_mood = {
            "грусть": ["1+1", "Зеленая миля", "Побег из Шоушенка","Мальчик в полосатой пижаме","Хорошие дети не плачут","Дневник памяти","До встречи с тобой","2+1","В метре друг от друга","Малышка на миллион","Дорогой Джон","Мост в Терабитию","Собачья жизнь","Последний урок","Куда приводят мечты","Жизнь прекрасна","Виноваты звезды","Хатико: Самый верный друг"],
            "радость": ["Мальчишник в Вегасе", "Миссия невыполнима", "Тайна Коко","Стажер","Проект X: Дорвались","Машина времени в джакузи","Superнянь","Безбрачная неделя","Очень плохая училка","Мы — Миллеры","Американский пирог: Все в сборе","Однажды в Вегасе","Впритык","Мачо и ботан","Кадры","SuperПерцы","Хочу как ты","Шафер напрокат","Сексдрайв","Несносные боссы","Побег из Вегаса","Ананасовый экспресс: Сижу, курю","Солдаты неудачи"],
            "страх": ["Оно", "Сияние", "Паранормальное явление","Ведьма из Блэр: Курсовая с того света","Заклятие","Призраки дома на холме","Хижина в лесу","Астрал","Женщина в черном","Мертвая тишина","Синистер"," 1408","Истории призраков","Заклятие 2","Окулус"],
            "гнев": ["Безумный Макс", "Джон Уик", "Криминальное чтиво","Гнев","Олдбой","Убить Билла","Славные парни","Леон","Месть","Драйв","Семь","Гладиатор","Бойцовский клуб","Неудержимые","Малхолланд Драйв","Пила","Молчание ягнят","Догвилль","Американская история X","Враг государства","Терминатор 2: Судный день", "Мстители","Джокер","Свой среди чужих, чужой среди своих","Мечтатели"],
            "спокойствие": ["В погоне за счастьем", "Марли и я", "Легенда о пианисте","Изгой","Мирный воин","Жизнь Пи","Ветер крепчает","Секрет","Мой сосед Тоторо","Песнь моря","Большой и добрый великан","Книга джунглей","Аватар","Мост в Терабитию","Октябрьское небо","Малыш","Амели","Поллианна","Великий побег","Хроники Нарнии: Лев, колдунья и волшебный шкаф","Маленькая мисс Счастье","Дом у озера","Секретный сад","Пираты Карибского моря: Проклятие Чёрной жемчужины","Вверх","Король Лев","Звёздная пыль","Хоббит: Нежданное путешествие"],
        }

    def get_movies_by_mood(self, mood: str) -> list:
        """Возвращает список фильмов по настроению."""
        if mood not in self.movies_by_mood:
            raise InvalidMoodError(mood)
        return self.movies_by_mood[mood]
    @validate_mood
    def get_movies_by_mood(self, mood: str) -> list:
        """Возвращает список фильмов по настроению."""
        return self.movies_by_mood[mood]